OdCharMapper.convertAlphaNumJapanese(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns converted ANSI string from Latin alpha numeric Japanese code page
\param str [in]  Source string for conversion.

OdCharMapper.convertAlphaNumJapanese(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns converted unicode string from Latin alpha numeric Japanese unicode range
\param str [in]  Source string for conversion.

OdCharMapper.convertCIFcoding(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns converted unicode string from CIF coding string
\param str [in]  Source string for conversion.

OdCharMapper.getCheckSumUnicode(OdString)
\details
Returns the check sum for a unicode string.
\param str [in]  String for calculating check sum.

OdCharMapper.getCheckSumAnsi(OdAnsiString)
\details
Returns the check sum for an ANSI string.
\param str [in]  String for calculating check sum.

OdCharMapper.getCpIndexByBigFont(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the code page index.
\remarks
getCpIndexByBigFont returns one of the following:
Value     Description
1         CP_ANSI_932
2         CP_ANSI_950
3         CP_ANSI_949
5         CP_ANSI_936
\param bigFont [in]  big font file name.

OdCharMapper.getCpByBigFont(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the OdCodePageId.
\remarks
getCpByBigFont returns one of the following:
@untitled table
CP_ANSI_932
CP_ANSI_950
CP_ANSI_949
CP_ANSI_936
\param bigFont [in]  big font file name.

OdCharMapper.addBigFontWithCodepage(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdCodePageId)
\details
Adds the bigFont to map.
\param bigFont [in]  big font file name.
\param codePageId [in]  CodePage ID.
\remarks
codePageId must be one of the following:
@untitled table
CP_ANSI_932
CP_ANSI_950
CP_ANSI_949
CP_ANSI_936
Returns eOk if successful, or an appropriate error code if not.

OdCharMapper.addBigFontWithIndex(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Int32!System.Runtime.CompilerServices.IsLong)
\details
Adds the bigFont to map.
\param bigFont [in]  big font file name.
\param cpIndex [in]  code page index.
\remarks
cpIndex must be one of the following:
Value    Description
1        CP_ANSI_932
2        CP_ANSI_950
3        CP_ANSI_949
5        CP_ANSI_936
Returns eOk if successful, or an appropriate error code if not.

OdCharMapper.isConversionSupported(OdCodePageId)
\details
Returns true if and only if the specified code page supports conversion.
\param codepageId [in]  Object ID of the code page.

OdCharMapper.getCodepageByCharset(System.UInt16)
\details
Returns the code page corresponding to the specified ANSI character set.
\param ansiCharacterSet [in]  Character Set.

OdCharMapper.acadCpToAnsiCp(OdCodePageId)
\details
Returns the ANSI code page corresponding to the specified code page.
\param acadCodePageId [in]  code page.

OdCharMapper.ansiCpToAcadCp(System.UInt32!System.Runtime.CompilerServices.IsLong)
\details
Returns the code page corresponding to the specified ANSI code page.
\param ansiCodePage [in]  ANSI code page.

OdCharMapper.numValidCodepages
\details
Returns the number of valid code pages for this CharMapper object.

OdCharMapper.codepageIdToDesc(OdCodePageId,OdString*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the description for the specified code page.
\param description [out]  Receives the description.
\param codepageId [in]  Object ID of the code page.
\returns
Returns eOk if successful, or an appropriate error code if not.

OdCharMapper.codepageDescToId(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdCodePageId*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the code page with the specified description.
\param description [in]  Description.
\param codepageId [out]  Receives the object ID of the code page.
\returns
Returns eOk if successful, or an appropriate error code if not.

OdCharMapper.isLeadByte(System.Byte,OdCodePageId)
\details
Returns true if and only if the specified byte is one of the leading bytes of the specified code page.
\param testByte [in]  Byte to test.
\param codepageId [in]  Object ID of the code page.

OdCharMapper.codepageToUnicode(System.UInt16,OdCodePageId,System.UInt16*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Maps the specified code page character to Unicode.
\param sourceChar [in]  Code page source character.
\param codepageId [in]  Object ID of the code page.
\param unicodeChar [out]  Receives the Unicode character.
\returns
Returns eOk if successful, or an appropriate error code if not.

OdCharMapper.unicodeToCodepage2(System.UInt16,OdCodePageId,System.UInt16*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Maps the specified Unicode character to the specified code page using IMLangFontLink2 interface.
\param sourceChar [in]  Unicode source character.
\param codepageId [in]  Object ID of the code page.
\param codepageChar [out]  Receives the code page character.
\returns
Returns eOk if successful, or an appropriate error code if not.

OdCharMapper.unicodeToCodepage(System.UInt16,OdCodePageId,System.UInt16*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Boolean)
\details
Maps the specified Unicode character to the specified code page.
\param sourceChar [in]  Unicode source character.
\param codepageId [in]  Object ID of the code page.
\param codepageChar [out]  Receives the code page character.
\param bTryToUseSystemCP [in]   Try to use default ANSI code page and OEM  code page in case conversion with codepageId is not OK
\returns
Returns eOk if successful, or an appropriate error code if not.

OdCharMapper.initialize(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Initializes this CharMapper object from the specified mapping file.
\param filename [in]  File name.
\returns
Returns eOk if successful, or an appropriate error code if not.